{"/posts/2025/05/25/one-month-of-youtube/":{"data":{"":"","heading#\u003ca href=\"https://www.youtube.com/watch?v=Ufmu1WD2TSk\"\u003e\u0026ldquo;SOUTH KOREA IS OVER\u0026rdquo;\u003c/a\u003e":"","heading-1#\u003ca href=\"https://www.youtube.com/watch?v=nnsyGSTKlw0\u0026amp;t=1631s\"\u003e\u0026ldquo;I hate my phone so I got rid of it\u0026rdquo;\u003c/a\u003e":"","heading-2#\u003ca href=\"https://www.youtube.com/watch?v=DbflAVPEhys\"\u003e\u0026ldquo;Kocsmázás a kapuvári Néma Bobnál: a házmester, a konyhafőnök, a kutyapanziós és egy kényszerpesti\u0026rdquo;\u003c/a\u003e":"","heading-3#\u003ca href=\"https://www.youtube.com/watch?v=01g_MccJPdU\"\u003e\u0026ldquo;Megnéztem a jövőt Shanghai-ban – Kínai kalandok E01\u0026rdquo;\u003c/a\u003e":"","heading-4#\u003ca href=\"https://www.youtube.com/watch?v=zsZ9LRj0IkM\u0026amp;t=408s\"\u003e\u0026ldquo;What Do Chinese Think About Russia? - Chinese Street Interview - Intermediate Chinese\u0026rdquo;\u003c/a\u003e":"","heading-5#\u003ca href=\"https://www.youtube.com/watch?v=pVI_smLgTY0\"\u003e\u0026ldquo;I installed Linux (so should you) \u0026ldquo;\u003c/a\u003e":"As a first post I thought to share my Youtube watching experiences from last month. To be honest I think 80% of it is thrash looking at it in retrospect, but there are definitely some that I find invaluable. I will mostly cover Youtube videos from content creaters that I follow, not just randomly clicked on from my feed.\n“SOUTH KOREA IS OVER” This episode of Kurzgesagt - In a Nutshell attempts to predict the future of South Korea focusing on the total fertility rate, that is the average number of children a woman has over her lifetime. Nowadays usually the political right worries about the decreasing population (at least in Hungary). So it’s interesting to see a video from a progressive(?)/scientific channel. What really made an impression on me in this video is when they interpret the effect of fertility rate over time. That goes along this line: Take 100 people in the first generation, let the fertility rate be one. That means in two generations (around 50 years), the size of generations will halve twice, meaning that the second generation will be 50 people and the third one will only have 25 people on average.\n“I hate my phone so I got rid of it” Okay, sooo this is a Youtuber guy who I was not subscribed to before but the algorithm threw it at me. Later I even read about his experiment in the news, so seemingly this was a viral one. The experiment was simple: not using his smartphone for some weeks. Or at least it seemed simple, but in fact required quite some forward planning to actually achieve it. I liked this one because I also believe that smartphones have intruded too much into our lives.\n“Kocsmázás a kapuvári Néma Bobnál: a házmester, a konyhafőnök, a kutyapanziós és egy kényszerpesti” Partizán is one of the most, if not most, impactful politics themed Hungarian Youtube channel. But this video stands out from the others. In this series Marci (the “interviewer”) plays the role of a bar tender and talks to more or less everyday people casually. When I was watching, I was like, how can it be soo good?? Based on the comment section as well, it seems that the series had a great reception. I liked this series because it showed how people in different parts of my country think, what were their experiences, etc., but mostly because it pointed out that we actually don’t know our own culture. And we have a desire to learn more about it.\n“Megnéztem a jövőt Shanghai-ban – Kínai kalandok E01” I used to like watching this guy’s videos. Then I stopped because (1) I don’t care about cars that much (2) I think his view that electric cars will solve climate change and be much better for us in the long term is not correct. Rather I think that our life (and our climate) would get better by prioritizing public transportation and walkable/cyclable urban designing.\nComing back from the tangent, basically the reason why I think this is an interesting video is because he seems to be genuinely impressed by the Chinese big city vibes of Shanghai and overall about the Chinese environment there (kind of a positive culture shock). This is not really a new phenomenon in the international section of Youtube but for Hungarian viewers there are fewer content like this available. This way the Hungarians get a peek into China. However, I don’t agree with everything he says. András H. has such a positive culture shock that he wants everything to appear better than in Hungary (or in the West). One example for that is the air quality, which is quite good at the time of his visit but still visible worse than in almost any day of the year in Budapest.\n“What Do Chinese Think About Russia? - Chinese Street Interview - Intermediate Chinese” This channel is a great resource for learning Chinese. Basically the woman does interviews about various topics in Chinese with the everyday people on the streets, providing Chinese, English and pinyin subtitle. Apart from being a great source for learning, it is a surprisingly good way to learn about the worldview of Chinese and their culture. In this video they are asked about Russia, which I was surprised to see that most of them sympathize with. Besides, there are many interesting videos, for example about bride price/dowry, burnout at work in China and so on.\n“I installed Linux (so should you) “ PewDiePie was one of the biggest youtuber at some time, now he uploads videos less frequently but still of good quality. Also interesting that his videos are more exploratory recently. In this one he shows and advocates for linux. Apart from liking that he recommended linux, I am also quite surprised how much he customized his desktop environment and optimized his boot time. Compared to that I have an almost unmodified environment, using Gnome with the default wallpaper… and I thought I am a tech guy."},"title":"One month of Youtube"}}